Repository: elsat26/ddt4all
Catalog: locale/ddt4all.po
Languages: sk_sk

source: Goto data
sk_sk: Prejdite na údaje

source: Remove
sk_sk: Odstrániť

source: Add to screen
sk_sk: Pridať na obrazovku

source: Add
sk_sk: Pridať

source: Send request bytes (HEX)
sk_sk: Odoslať požiadavku bajtov (HEX)

source: Receive bytes (HEX)
sk_sk: Prijímať bajty (HEX)

source: Data length
sk_sk: Dĺžka údajov

source: Shift byte count
sk_sk: Počet bajtov posunu

source: Data name;Start byte;Bit offset;Bit count;Endianess
sk_sk: Názov údajov; Počiatočný bajt; Bitové odsadenie; Bitový počet; Endianess

source: Little
sk_sk: Malý

source: Big
sk_sk: Veľký

source: No SDS
sk_sk: Nie SDS

source: Plant
sk_sk: Nasadiť

source: After Sale
sk_sk: Výpredaj

source: Engineering
sk_sk: Inžinierstvo

source: Supplier
sk_sk: Dodávateľ

source: Reload requests
sk_sk: Obnoviť požiadavky

source: Add request
sk_sk: Pridať požiadavku

source: Send bytes
sk_sk: Odoslať bajty

source: Receive bytes
sk_sk: Prijať bajty

source: Number of bits
sk_sk: Počet bitov

source: Signed
sk_sk: Podpísané

source: Add item
sk_sk: Pridať položku

source: Del item
sk_sk: Vymazať položku

source: New item
sk_sk: Nová položka

source: Value;Text
sk_sk: Hodnota; Text

source: Number of bytes
sk_sk: Počet bajtov

source: Unit
sk_sk: Jednotka

source: Number of bit
sk_sk: Počet bitov

source: Format
sk_sk: Formátovať

source: Value = (AX+B) / C
sk_sk: Hodnota = (AX + B) / C

source: New
sk_sk: Nový

source: Duplicate selected
sk_sk: Duplikovať vybraté

source: Remove selected
sk_sk: Odstrániť vybrané

source: Reload
sk_sk: Obnoviť

source: Validate changes
sk_sk: Overiť zmeny

source: Description
sk_sk: Popis

source: Data type
sk_sk: Typ údajov

source: Numeric
sk_sk: Číselné

source: Numeric items
sk_sk: Číselné položky

source: Data is used by request %s
sk_sk: Údaje sú použité požiadavkou %s

source: New data
sk_sk: Nové údaje

source: Replace me with request description
sk_sk: Nahradiť popisom požiadavky

source: Data name;Description
sk_sk: Názov údajov; Popis

source: Del
sk_sk: Vymazať

source: Refresh
sk_sk: Obnoviť

source: Move up
sk_sk: Posunúť nahor

source: Check
sk_sk: Skontrolovať

source: Request %s not found
sk_sk: Žiadosť %s sa nenašla

source: <font color=green>Request <font color=blue>'%s'</font> has no missing input values</font>
sk_sk: <font color=green>Žiadosť<font color=blue>'%s'</font> nemá chýbajúce vstupné hodnoty</font>

source: <font color=red>Request <font color=blue>'%s'</font> has missing inputs :</font>
sk_sk: <font color=red>Žiadosť<font color=blue>'%s'</font> má chýbajúce vstupy :</font>

source: Delay;Request
sk_sk: Oneskorenie; Žiadosť

source: Screen initialization
sk_sk: Inicializácia obrazovky

source: Requests to send before screen drawing
sk_sk: Žiadosti o odoslanie pred kresbou obrazovky

source: ECU Function address
sk_sk: Adresa funkcie ECU

source: ECU Protocol
sk_sk: Protokol ECU

source: Tool > Ecu ID (Hex)
sk_sk: Nástroj> ID Ecu (Hex)

source: Ecu > Tool ID (Hex)
sk_sk: Ecu> ID nástroja (Hex

source: Coding
sk_sk: Kódovanie

source: Big Endian
sk_sk: Veľký Endian

source: Little Endian
sk_sk: Malý Endian

source: ECU Auto identification
sk_sk: Automatická identifikácia ECU

source: Add new
sk_sk: Pridať nový

source: Delete selected
sk_sk: Odstrániť vybrané

source: Diag version
sk_sk: Diag verzia

source: Version
sk_sk: Verzia

source: ECU name
sk_sk: Názov ECU

source: Protocol
sk_sk: Protokol

source: Projets
sk_sk: Projekt

source: loaded ECUs in database.
sk_sk: nahravanie databazy ECU.

source: Refresh rate (ms):
sk_sk: Obnovovacia frekvencia (ms)

source: Can timeout (ms) [0:AUTO] :
sk_sk: Can časový limit (ms) [0: AUTO]:

source: Documentation
sk_sk: Dokumentácia

source: Screen
sk_sk: Obraz

source: Requests
sk_sk: Požiadavky

source: Data
sk_sk: Údaje

source: Buttons
sk_sk: Tlačidlá

source: Ecu parameters
sk_sk: Parametre Ecu

source: Screens
sk_sk: Vybrať ďaľšie

source: Action
sk_sk: Akcia

source: New Category
sk_sk: Nová kategória

source: New Screen
sk_sk: Nová obrazovka

source: Rename
sk_sk: Premenovať

source: File
sk_sk: Súbor

source: Read DTC
sk_sk: Čítať DTC

source: Full log
sk_sk: Úplný denník

source: Expert mode (enable writing)
sk_sk: Expertný režim (povoliť zápis)

source: Auto refresh
sk_sk: Automatické obnovenie

source: Refresh (one shot)
sk_sk: Obnoviť (jeden záber)

source: Manual command
sk_sk: Manuálny príkaz

source: Zoom In
sk_sk: Priblížiť

source: Zoom Out
sk_sk: Zmenšiť

source: UI Edit
sk_sk: Úprava používateľského rozhrania

source: Open XML
sk_sk: Otvoriť XML

source: Create New ECU
sk_sk: Vytvoriť novú ECU

source: Save current ECU
sk_sk: Uložiť aktuálnu ECU

source: Save ECU list
sk_sk: Uložiť zoznam ECU

source: Zip database
sk_sk: Zip databáza

source: Plugins
sk_sk: Pluginy

source: Cannot load plugin %s, %s
sk_sk: Nie je možné načítať plugin %s, %s

source: Save database (keep '.zip' extension)
sk_sk: Uložiť databázu (zachovať príponu .zip)

source: Zipping XML database... (this can take a few minutes
sk_sk: Zipovanie XML databázy ... (to môže trvať niekoľko minút

source: Zip job finished
sk_sk: Úloha bola dokončená

source: Enter new name
sk_sk: Zadajte nový názov

source: Enter category name
sk_sk: Zadajte názov kategórie

source: Please select a category before creating new screen
sk_sk: Pred vytvorením novej obrazovky vyberte kategóriu

source: Enter screen name
sk_sk: Zadajte názov obrazovky

source: Scan options
sk_sk: Možnosti kontroly

source: CANCEL
sk_sk: ZRUŠIŤ

source: Scanning CAN
sk_sk: Skenovanie CAN

source: Scanning KWP
sk_sk: Skenovanie KWP

source: EDITION MODE
sk_sk: Demo režim

source: CONNECTED
sk_sk: PRIPOJENÝ

source: DISCONNECTED
sk_sk: ODPOJENÝ

source: Save vehicule (keep '.ecu' extension)
sk_sk: Uložiť vozidlo (zachovať" .ecu "rozšírenie)

source: Save ECU (keep '.json' extension)
sk_sk: Uložiť ECU (Keep '.json' extension)

source: <center>This Software is free, but I need money to buy cables/ECUs and make this application more reliable</center>
sk_sk: Tento softvér je zadarmo, ale potrebujem peniaze na kúpu káblov / ECU a zvýšenie spoľahlivosti tejto aplikácie

source: Yes I contribute
sk_sk: Áno, prispejem

source: No, I don't
sk_sk: Nie, nechcem

source: <center>Thank you for you contribution, if nothing happens, please go to : https://github.com/cedricp/ddt4all</center>
sk_sk: <center> Ďakujeme za príspevok, ak sa nič nestane, prejdite na adresu: Https://github.com/cedricp/ddt4all </ center>

source: ELM port selection
sk_sk: Výber portu ELM

source: Port speed
sk_sk: Rýchlosť portu

source: Connected mode
sk_sk: Režim pripojenia

source: Edition mode
sk_sk: Demo mód

source: ELM benchmark
sk_sk: ELM Skúška

source: I'm aware that I can harm my car if badly used
sk_sk: Som si vedomý toho, že môžem poškodiť svoje auto, ak je zle použité

source: You must check the recommandations
sk_sk: Musíte prečítať a označiť odporúčania

source: Please select a communication port
sk_sk: Vyberte komunikačný port

source: Using custom DDT database
sk_sk: Používanie vlastnej databázy DDT

source: No COM port selected
sk_sk: Nie je vybratý žiadny COM port

source: Initilizing ELM with speed %i...
sk_sk: Inicializacia ELM s rychlostou %i ...

source: No ELM327 or OBDLINK-SX detected on COM port
sk_sk: Bez ELM327 alebo OBDLINK-SX zistené na COM porte

source: Error:
sk_sk: Chyba:

source: ELM not connected or wrong COM port
sk_sk: ELM nie je pripojený alebo je chybný COM port

source: Connection to ELM was lost
sk_sk: Pripojenie k ELM bolo stratene

source: TIMEOUT
sk_sk: ČAS VYPRŠAL

source: Checking port speed:
sk_sk: Kontrola rýchlosti portu:

source: Start COM speed :
sk_sk: Spustiť rýchlosť COM:

source: ELM not responding
sk_sk: ELM neodpovedá

source: ERROR - wifi do not support changing baud rate
sk_sk: CHYBA - wifi nepodporujú zmenu prenosovej rýchlosti

source: Changing baud rate to:
sk_sk: Zmena prenosovej rýchlosti na:

source: ERROR - command not supported
sk_sk: CHYBA - príkaz nie je podporovaný

source: ERROR - rate not supported. Let's go back.
sk_sk: ERROR - rýchlosť nie je podporovaná. Poďme späť.

source: ERROR - something went wrong. Let's get back.
sk_sk: CHYBA - niečo sa pokazilo. Poďme späť.

source: Trying to open port
sk_sk: Pokusam sa otvorit port

source: No ELM interface on port
sk_sk: Žiadne rozhranie ELM na porte

source: FAIL
sk_sk: ZLIHANIE

source: OK/TIMEOUT
sk_sk: OK/ČAS VYPRŠAL

source: Incompatible adapter on ARM core
sk_sk: Nekompatibilný adaptér na jadre ARM

source: Result:
sk_sk: Výsledok

source: succeeded from
sk_sk: úspešné z

source: ELM Max version:
sk_sk: Maximálna verzia ELM:

source: Adding source file %s
sk_sk: Pridanie zdrojového súboru %s

source: Adding plugin file %s
sk_sk: Pridanie súboru pluginu %s

source: To be able to edit your screen, first export it in JSON format
sk_sk: Ak chcete upraviť obrazovku, najprv ju exportujte vo formáte JSON

source: Enter label name
sk_sk: Zadajte názov menovky

source: Add button
sk_sk: Pridať tlačidlo

source: Add label
sk_sk: Pridať štítok

source: Rename label
sk_sk: Premenovať štítok

source: Change color
sk_sk: Zmeniť farbu

source: Remove element
sk_sk: Odstrániť element

source: Diagnotic session
sk_sk: Diagnostická relácia

source: Input
sk_sk: Vstup

source: Output
sk_sk: Výstup

source: XML file not found :
sk_sk: Súbor XML sa nenašiel

source: Invalid DDT file
sk_sk: Neplatný súbor DDT

source: Connection to ELM lost, trying to reconnect...
sk_sk: Prepojenie s ELM stratené, pokus o opätovné pripojenie ...

source: Cannot reconnect...
sk_sk: Nie je možné pripojiť ...

source: Switching to session mode
sk_sk: Prepnutie do režimu relácie

source: Sending ELM request :
sk_sk: Odoslanie požiadavky ELM:

source: Blocked ELM request :
sk_sk: Blokovaná požiadavka ELM:

source: Sending ELM request:
sk_sk: Odoslanie požiadavky ELM:

source: Sending simulated ELM request :
sk_sk: Odoslanie simulovanej požiadavky ELM:

source: Bad ELM response :
sk_sk: Chybná odpoveď ELM:

source: ELM response :
sk_sk: Odpoveď ELM

source: Button request not found :
sk_sk: Žiadosť o tlačidlo sa nenašla

source: Sending request :
sk_sk: Odoslanie požiadavky:

source: Request aborted (look at red paramters entries):
sk_sk: Žiadosť bola prerušená (pozrite sa na červené položky parametrov)

source: Invalid
sk_sk: Neplatné

source: ECU uses SDS
sk_sk: ECU používa SDS

source: Cannot call request
sk_sk: Nie je možné volať požiadavku

source: Clearing DTC information
sk_sk: Vymazanie informácií o DTC

source: No ClearDTC request for that ECU, will send default 14FF00
sk_sk: Žiadna žiadosť o ClearDTC pre túto ECU, pošle štandardnú 14FF00

source: <center>You are about to clear diagnostic troubles codes</center>
sk_sk: <center> Chystáte sa vymazať diagnostické poruchové kódy </center>

source: <center>Ae you sure this is what you want.</center>
sk_sk: <center> Ste si istý, že toto je to, čo chcete. </center>

source: Invalid response for ReadDTC command
sk_sk: Neplatná odpoveď pre príkaz ReadDTC

source: Read DTC returned an error
sk_sk: Čítanie DTC vrátilo chybu

source: No DTC
sk_sk: Bez DTC

source: Clear ALL DTC
sk_sk: Vymazať VŠETKO DTC

source: ECU trouble codes
sk_sk: Chybové kódy ECU

source: Parsing screen
sk_sk: Analýza obrazovky

source: Values
sk_sk: Hodnoty

source: Waiting...
sk_sk: Čaká sa ...

source: Frame hex error :
sk_sk: Chyba hexadecimálneho rámca

source: Airbag Tools
sk_sk: Nástroje Airbag

source: Check ACU Virgin
sk_sk: Skontrolovať ACU Virgin

source: Waiting
sk_sk: Čakajte

source: Cannot connect to ECU
sk_sk: Nedá sa pripojiť k ECU

source: <font color='orange'>UNEXPECTED RESPONSE</font>
sk_sk: <font color='orange'>NEVYKONANÁ ODPOVEĎ</font>

source: <font color='red'>CRASH DETECTED</font>
sk_sk: <font color='red'>HAVÁRIA</font>

source: <font color='green'>NO CRASH DETECTED</font>
sk_sk: <font color='green'>NEZISTENÁ HAVÁRIA</font>

source: <font color='green'>CLEAR EXECUTED</font>
sk_sk: <font color='green'>VYČISTIŤ</font>

source: <font color='red'>CLEAR FAILED</font>
sk_sk: <font color='red'>ČISTENIE ZLYHALO</font>

source: Megane/Scenic II card programming
sk_sk: Programovanie karty Megane / Scenic II

source: Keys
sk_sk: Kľúč

source: ENTER AFTER SALE MODE
sk_sk: ZADAŤ PO REŽIME PREDAJA

source: <font color='red'>MEGANE II CARD PROGRAMMING<br>EXPERIMENTAL : NOT TESTED YET</font>
sk_sk: <font color='red'>PROGRAMOVANIE KARTY MEGANE II - EXPERIMENTÁLNE: NIE JE TESTOVANÉ</font>

source: LEARN
sk_sk: NAUČIŤ

source: VALIDATE
sk_sk: OVERENIE

source: Num key learnt
sk_sk: Num key naučené

source: CARD IDE
sk_sk: ID KARTY

source: Cannot get ISK, check connections and UCH compatibility
sk_sk: Nemôžem získať ISK, kontrolovať pripojenia a kompatibilitu s UCH

source: <font color='red'>PIN CODE NOT RECOGNIZED</font>
sk_sk: <font color='red'>PIN Kód nie je rozpoznaný</font>

source: <font color='green'>PIN CODE OK / KEY LEARNING</font>
sk_sk: <font color='green'>PIN Kód OK / Kľúč naučený</font>

source: Modus/Clio III EPS Reset
sk_sk: Obnovenie EPS Modus / Clio III

source: EPS Tools
sk_sk: Nástroje EPS
